Revit 2024 API
HermiteSpline.Create Method
Overload List
Name | Description
Create(IList<XYZ>, Boolean)
 Creates a Hermite spline with default tangency at its endpoints.
Create(IList<XYZ>, Boolean, HermiteSplineTangents)
 Creates a Hermite spline with specified tangency at its endpoints.
See Also
HermiteSpline Class
HermiteSpline Members
Autodesk.Revit.DB Namespace